app/Controllers/Auth.php

SELECT *
FROM `pegawai`
WHERE `pegawai`.`id_pegawai` = '93k3'
---
                    session()->set('role', $cek_login['role']);


                    $nama = $this->datapegawai->find($cek_login['id_pegawai']);