app/Controllers/Datanilai.php

SELECT *
FROM `emis`
---
    public function create24()
    {
        # code...

        $data['datanis'] = $this->emismodel->findAll();