app/Controllers/Spp.php

SELECT *
FROM `pegawai`
---
    public function create4()
    {
        # code...
        $data['datanis'] = $this->sppmodel->findAll();
        $data['datapegawai'] = $this->gurumodel->findAll();