app/Models/Auth_model.php

    public function cek_login($id_pegawai)
    {
        $query = $this->table('user')
            ->where('id_pegawai', $id_pegawai)
            ->countAll();

        if ($query >  0) {
            $hasil = $this->table('user')
                ->where('id_pegawai', $id_pegawai)
                ->limit(1)
                ->get()
                ->getRowArray();
---
SELECT *
FROM `user`
WHERE `id_pegawai` = '93K3'
 LIMIT 1