app/Models/Dataguru_model.php

SELECT *
FROM `pegawai`
WHERE `id_pegawai` = 'Nd01'
---
    public function getCategory($id = false)
    {
        # code...
        if ($id == false) {

            return $this->findAll();
        } else {
            return $this->getWhere(['id_pegawai' => $id]);