app/Models/Emis_model.php

SELECT *
FROM `emis`
WHERE `nis` = '101'
---
    public function getCategory($id = false)
    {
        # code...
        if ($id == false) {

            return $this->findAll();
        } else {
            return $this->getWhere(['nis' => $id]);