app/Models/Pembelajaran_model.php

SELECT *
FROM `pembelajaran`
WHERE `id_pembelajaran` = '5'
---
    public function getCategory($id = false)
    {
        # code...
        if ($id == false) {

            return $this->findAll();
        } else {
            return $this->getWhere(['id_pembelajaran' => $id]);

SELECT *
FROM `manajemen_kelas`
---
    public function getKelas()
    {
        // Ambil data kelas dari database (misalnya tabel "kelas")
        // $query = $this->db->get('kelas');
        // $query = $this->db->table('manajemen_kelas')->get();
        // return $query->getResultArray();
        // $data['kelas'] = $this->model->getKelas();
        // return $this->findAll();

        $query = $this->db->table('manajemen_kelas')->get();

SELECT *
FROM `manajemen_ajaran`
---
    public function getTahunajaran()
    {
        // Ambil data kelas dari database (misalnya tabel "kelas")
        // $query = $this->db->get('kelas');
        // $query = $this->db->table('manajemen_ajaran')->get();
        // return $query->getResultArray();
        // $data['tahun_ajaran'] = $this->model->getTahunajaran();
        // return $this->findAll();

        $query = $this->db->table('manajemen_ajaran')->get();